### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.sonarcube-aci.azurerm_container_group.sonarqube_aci will be created
+   resource "azurerm_container_group" "sonarqube_aci" {
+       dns_name_label              = "sonarqube-aci-7043"
+       dns_name_label_reuse_policy = "Unsecure"
+       exposed_port                = (known after apply)
+       fqdn                        = (known after apply)
+       id                          = (known after apply)
+       ip_address                  = (known after apply)
+       ip_address_type             = "Public"
+       location                    = "uksouth"
+       name                        = "sonarqubeaci7043"
+       network_profile_id          = (known after apply)
+       os_type                     = "Linux"
+       resource_group_name         = "Terraform-Sonarqube-aci-test"
+       restart_policy              = "OnFailure"
+       tags                        = {
+           "Author"      = "Marcel Lupo"
+           "Description" = "Sonarqube aci with caddy"
+           "GitHub"      = "https://github.com/Pwd9000-ML/terraform-azurerm-sonarqube-aci"
+           "Terraform"   = "True"
        }

+       container {
+           commands                     = []
+           cpu                          = 2
+           image                        = "sonarqube:lts-community"
+           memory                       = 8
+           name                         = "sonarqube-server"
+           secure_environment_variables = (sensitive value)

+           ports {
+               port     = 9000
+               protocol = "TCP"
            }

+           volume {
+               empty_dir            = false
+               mount_path           = "/opt/sonarqube/data"
+               name                 = "data"
+               read_only            = false
+               share_name           = "data"
+               storage_account_key  = (sensitive value)
+               storage_account_name = "sonarqubesa7043"
            }
+           volume {
+               empty_dir            = false
+               mount_path           = "/opt/sonarqube/extensions"
+               name                 = "extensions"
+               read_only            = false
+               share_name           = "extensions"
+               storage_account_key  = (sensitive value)
+               storage_account_name = "sonarqubesa7043"
            }
+           volume {
+               empty_dir            = false
+               mount_path           = "/opt/sonarqube/logs"
+               name                 = "logs"
+               read_only            = false
+               share_name           = "logs"
+               storage_account_key  = (sensitive value)
+               storage_account_name = "sonarqubesa7043"
            }
+           volume {
+               empty_dir            = false
+               mount_path           = "/opt/sonarqube/conf"
+               name                 = "conf"
+               read_only            = false
+               share_name           = "conf"
+               storage_account_key  = (sensitive value)
+               storage_account_name = "sonarqubesa7043"
            }
        }
+       container {
+           commands = [
+               "caddy",
+               "reverse-proxy",
+               "--from",
+               "sonar.pwd9000.com",
+               "--to",
+               "localhost:9000",
            ]
+           cpu      = 1
+           image    = "caddy:latest"
+           memory   = 1
+           name     = "caddy-reverse-proxy"

+           ports {
+               port     = 443
+               protocol = "TCP"
            }
+           ports {
+               port     = 80
+               protocol = "TCP"
            }
        }
    }

  # module.sonarcube-aci.azurerm_mssql_database.sonarqube_mssql_db is tainted, so must be replaced
-/+ resource "azurerm_mssql_database" "sonarqube_mssql_db" {
+       creation_source_database_id         = (known after apply)
!       id                                  = "/subscriptions/829efd7e-aa80-4c0d-9c1c-7aa2557f8e07/resourceGroups/Terraform-Sonarqube-aci-test/providers/Microsoft.Sql/servers/sonarqubemssql7043/databases/sonarqubemssqldb9000" -> (known after apply)
!       ledger_enabled                      = false -> (known after apply)
+       license_type                        = (known after apply)
!       maintenance_configuration_name      = "SQL_Default" -> (known after apply)
        name                                = "sonarqubemssqldb9000"
!       read_replica_count                  = 0 -> (known after apply)
+       restore_point_in_time               = (known after apply)
+       sample_name                         = (known after apply)
        tags                                = {
            "Author"      = "Marcel Lupo"
            "Description" = "Sonarqube aci with caddy"
            "GitHub"      = "https://github.com/Pwd9000-ML/terraform-azurerm-sonarqube-aci"
            "Terraform"   = "True"
        }
        # (12 unchanged attributes hidden)

-       long_term_retention_policy {
-           monthly_retention = "PT0S" -> null
-           week_of_year      = 1 -> null
-           weekly_retention  = "PT0S" -> null
-           yearly_retention  = "PT0S" -> null
        }

!       short_term_retention_policy {
-           backup_interval_in_hours = 12 -> null
            # (1 unchanged attribute hidden)
        }

-       threat_detection_policy {
-           disabled_alerts      = [] -> null
-           email_account_admins = "Disabled" -> null
-           email_addresses      = [] -> null
-           retention_days       = 0 -> null
-           state                = "Disabled" -> null
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```
</details>